brew "xz"
brew "aicommits"
brew "bat"
brew "bottom"
brew "cbonsai"
brew "cmatrix"
brew "cowsay"
brew "curlie"
brew "doggo"
brew "duf"
brew "dust"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fortune"
brew "fx"
brew "fzf"
brew "gcc"
brew "genact"
brew "git"
brew "git-delta"
brew "glow"
brew "gping"
brew "hydra"
brew "hyperfine"
brew "ipinfo-cli"
brew "lolcat"
brew "mapscii"
brew "mise"
brew "openjdk"
brew "p7zip"
brew "powerlevel10k"
brew "procs"
brew "ripgrep"
brew "ruby"
brew "sl"
brew "speedtest-cli"
brew "tealdeer"
brew "tree"
brew "ttyd"
brew "vhs"
brew "vim"
brew "yt-dlp"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "canva"
cask "clipy"
cask "discord"
cask "docker-desktop"
cask "figma"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "jordanbaird-ice"
cask "ngrok"
cask "slack"
cask "visual-studio-code"
cask "zoom"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "ajshort.include-autocomplete"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "cschlosser.doxdocgen"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "humao.rest-client"
vscode "maximetinu.identical-sublime-monokai-csharp-theme-colorizer"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mosapride.zenkaku"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "redhat.java"
vscode "ritwickdey.liveserver"
vscode "shardulm94.trailing-spaces"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "slevesque.shader"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "zignd.html-css-class-completion"
